status/2021/18jun21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>12 June 2021 - 18 June 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">12 June 2021 - 18 June 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd2fcfd0">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org4aba3a4">1.1. Next step</a>
<ul>
<li><a href="#orgd20414e">1.1.1. Check part assemblies</a></li>
<li><a href="#org4b7c05a">1.1.2. Print parts</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga5fc3d2">2. Swocer</a></li>
<li><a href="#orgc79124a">3. Linux Audio</a>
<ul>
<li><a href="#orgf8edfcb">3.1. Faust programming</a>
<ul>
<li><a href="#org99f65a2">3.1.1. Analog Synthesizer modules</a></li>
</ul>
</li>
<li><a href="#org7b92be3">3.2. Next Steps</a>
<ul>
<li><a href="#orge52de7e">3.2.1. GAC Patch save/restore</a></li>
<li><a href="#orgbe486d7">3.2.2. LV2 autopatcher</a></li>
<li><a href="#orgac0d04f">3.2.3. OSC control surface</a></li>
<li><a href="#org2b96d01">3.2.4. Faust/csound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org75dff06">4. EPICS</a>
<ul>
<li><a href="#org5f32acb">4.1. Next steps</a>
<ul>
<li><a href="#orge55d010">4.1.1. u3scpi network port testing</a></li>
<li><a href="#orgc904c7f">4.1.2. initial EPICS interface</a></li>
<li><a href="#orgfba291d">4.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org899e914">5. Brini Tracker II</a>
<ul>
<li><a href="#org5defad3">5.1. Next steps</a>
<ul>
<li><a href="#org06c0681">5.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgf0dd059">5.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#orgd6b869c">5.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org51e45cd">6. wktcolor</a>
<ul>
<li><a href="#org7c8caf4">6.1. Next steps</a>
<ul>
<li><a href="#orgf12d96d">6.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3d9d651">7. wktplot</a>
<ul>
<li><a href="#org58c0248">7.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org9658756">8. ca-r</a>
<ul>
<li><a href="#org3d3f7d8">8.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org2a7fbff">9. AMDGPU</a>
<ul>
<li><a href="#org4923474">9.1. Next step</a>
<ul>
<li><a href="#org336e477">9.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd3fd579">10. Ninja v Make</a>
<ul>
<li><a href="#orgf7e7392">10.1. Next Step</a>
<ul>
<li><a href="#org9d44cb6">10.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org16411a7">11. GMP Forth</a></li>
</ul>
</div>
</div>
<p>
The Great California Reopening - I guess
</p>

<div id="outline-container-orgd2fcfd0" class="outline-2">
<h2 id="orgd2fcfd0"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Designed smaller shelter for particle monitor. Complications arising
from PMS5003 requirement to have inlet and exhaust airflow separated.
</p>

<p>
Replacement sensors checked, boards cleaned.
</p>

<p>
Printed gas vent shelter connector bracket.
</p>
</div>

<div id="outline-container-org4aba3a4" class="outline-3">
<h3 id="org4aba3a4"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgd20414e" class="outline-4">
<h4 id="orgd20414e"><span class="section-number-4">1.1.1.</span> Check part assemblies</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Freecad/Step
</p>
</div>
</div>
<div id="outline-container-org4b7c05a" class="outline-4">
<h4 id="org4b7c05a"><span class="section-number-4">1.1.2.</span> Print parts</h4>
</div>
</div>
</div>

<div id="outline-container-orga5fc3d2" class="outline-2">
<h2 id="orga5fc3d2"><span class="section-number-2">2.</span> Swocer</h2>
<div class="outline-text-2" id="text-2">
<p>
Added STEP file generation (support for SCZWS assembly checks)
</p>
</div>
</div>

<div id="outline-container-orgc79124a" class="outline-2">
<h2 id="orgc79124a"><span class="section-number-2">3.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf8edfcb" class="outline-3">
<h3 id="orgf8edfcb"><span class="section-number-3">3.1.</span> Faust programming</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org99f65a2" class="outline-4">
<h4 id="org99f65a2"><span class="section-number-4">3.1.1.</span> Analog Synthesizer modules</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Waveshaper, Frequency Shifter, Karplus-Strong Plucked String
</p>
</div>
</div>
</div>
<div id="outline-container-org7b92be3" class="outline-3">
<h3 id="org7b92be3"><span class="section-number-3">3.2.</span> Next Steps</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orge52de7e" class="outline-4">
<h4 id="orge52de7e"><span class="section-number-4">3.2.1.</span> GAC Patch save/restore</h4>
</div>
<div id="outline-container-orgbe486d7" class="outline-4">
<h4 id="orgbe486d7"><span class="section-number-4">3.2.2.</span> LV2 autopatcher</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</div>
<div id="outline-container-orgac0d04f" class="outline-4">
<h4 id="orgac0d04f"><span class="section-number-4">3.2.3.</span> OSC control surface</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</div>
<div id="outline-container-org2b96d01" class="outline-4">
<h4 id="org2b96d01"><span class="section-number-4">3.2.4.</span> Faust/csound</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
See if a faust generated unit works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org75dff06" class="outline-2">
<h2 id="org75dff06"><span class="section-number-2">4.</span> EPICS</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5f32acb" class="outline-3">
<h3 id="org5f32acb"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orge55d010" class="outline-4">
<h4 id="orge55d010"><span class="section-number-4">4.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orgc904c7f" class="outline-4">
<h4 id="orgc904c7f"><span class="section-number-4">4.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgfba291d" class="outline-4">
<h4 id="orgfba291d"><span class="section-number-4">4.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org899e914" class="outline-2">
<h2 id="org899e914"><span class="section-number-2">5.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-5">
<p>
Still working!
</p>
</div>
<div id="outline-container-org5defad3" class="outline-3">
<h3 id="org5defad3"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org06c0681" class="outline-4">
<h4 id="org06c0681"><span class="section-number-4">5.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgf0dd059" class="outline-4">
<h4 id="orgf0dd059"><span class="section-number-4">5.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-orgd6b869c" class="outline-4">
<h4 id="orgd6b869c"><span class="section-number-4">5.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org51e45cd" class="outline-2">
<h2 id="org51e45cd"><span class="section-number-2">6.</span> wktcolor</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7c8caf4" class="outline-3">
<h3 id="org7c8caf4"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgf12d96d" class="outline-4">
<h4 id="orgf12d96d"><span class="section-number-4">6.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d9d651" class="outline-2">
<h2 id="org3d9d651"><span class="section-number-2">7.</span> wktplot</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org58c0248" class="outline-3">
<h3 id="org58c0248"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>

<div id="outline-container-org9658756" class="outline-2">
<h2 id="org9658756"><span class="section-number-2">8.</span> ca-r</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org3d3f7d8" class="outline-3">
<h3 id="org3d3f7d8"><span class="section-number-3">8.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-8-1">
<p>
None, but expecting ca-tier to break now that the tier system is
deprecated.
</p>
</div>
</div>
</div>

<div id="outline-container-org2a7fbff" class="outline-2">
<h2 id="org2a7fbff"><span class="section-number-2">9.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org4923474" class="outline-3">
<h3 id="org4923474"><span class="section-number-3">9.1.</span> Next step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org336e477" class="outline-4">
<h4 id="org336e477"><span class="section-number-4">9.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orgd3fd579" class="outline-2">
<h2 id="orgd3fd579"><span class="section-number-2">10.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgf7e7392" class="outline-3">
<h3 id="orgf7e7392"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org9d44cb6" class="outline-4">
<h4 id="org9d44cb6"><span class="section-number-4">10.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org16411a7" class="outline-2">
<h2 id="org16411a7"><span class="section-number-2">11.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-11">
<p>
Need to think about adding floating point support
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
